In [5]:
# https://python-course.eu/numerical-programming/accessing-and-changing-values-dataframes.php

In [6]:
import pandas as pd

first = ('Mike', 'Dorothee', 'Tom', 'Bill', 'Pete', 'Kate')
last = ('Meyer', 'Maier', 'Meyer', 'Mayer', 'Meyr', 'Mair')
job = ('data analyst', 'programmer', 'computer scientist', 
       'data scientist', 'accountant', 'psychiatrist')
language = ('Python', 'Perl', 'Java', 'Java', 'Cobol', 'Brainfuck')

df = pd.DataFrame(list(zip(last, job, language)), 
                  columns =['last', 'job', 'language'],
                  index=first) 
df

           last                 job   language
Mike      Meyer        data analyst     Python
Dorothee  Maier          programmer       Perl
Tom       Meyer  computer scientist       Java
Bill      Mayer      data scientist       Java
Pete       Meyr          accountant      Cobol
Kate       Mair        psychiatrist  Brainfuck

In [7]:
# accessing the job of Bill:
print(df.loc['Bill', 'job'])
# alternative way to access it with at:
print(df.at['Bill', 'job'])

# setting the job of Bill to 'data analyst' with 'loc'
df.loc['Bill', 'job'] = 'data analyst'
# let us check it:
print(df.loc['Bill', 'job'])

# setting the job of Bill to 'computer scientist' with 'at'
df.at['Pete', 'language'] = 'Python'

data scientist
data scientist
data analyst

In [9]:
%timeit df.loc['Bill', 'language'] = 'Python'

72.5 µs ± 3.83 µs per loop (mean ± std. dev. of 7 runs, 10,000 loops each)

In [10]:
%timeit df.at['Bill', 'language'] = 'Python'

82 µs ± 3.51 µs per loop (mean ± std. dev. of 7 runs, 10,000 loops each)

In [11]:
s = pd.Series([27, 33, 13, 19])
s.replace(13, 42)

0    27
1    33
2    42
3    19
dtype: int64

In [12]:
s

0    27
1    33
2    13
3    19
dtype: int64

In [13]:
s = pd.Series([27, 33, 13, 19])
s.replace(13, 42, inplace=True)
s

0    27
1    33
2    42
3    19
dtype: int64

In [14]:
s

0    27
1    33
2    42
3    19
dtype: int64

In [15]:
s = pd.Series([0, 1, 2, 3, 4])
s.replace([0, 1, 2], 42, inplace=True)
s

0    42
1    42
2    42
3     3
4     4
dtype: int64

In [16]:
import pandas as pd

first = ('Mike', 'Dorothee', 'Tom', 'Bill', 'Pete', 'Kate')
last = ('Meyer', 'Maier', 'Meyer', 'Mayer', 'Meyr', 'Mair')
job = ('data analyst', 'programmer', 'computer scientist', 
       'data scientist', 'programmer', 'psychiatrist')
language = ('Python', 'Perl', 'Java', 'Pithon', 'Pythen', 'Brainfuck')

df = pd.DataFrame(list(zip(last, job, language)), 
                  columns =['last', 'job', 'language'],
                  index=first) 

df

           last                 job   language
Mike      Meyer        data analyst     Python
Dorothee  Maier          programmer       Perl
Tom       Meyer  computer scientist       Java
Bill      Mayer      data scientist     Pithon
Pete       Meyr          programmer     Pythen
Kate       Mair        psychiatrist  Brainfuck

In [17]:
df.replace("programmer", 
           "computer scientist", 
           inplace=True)
df

           last                 job   language
Mike      Meyer        data analyst     Python
Dorothee  Maier  computer scientist       Perl
Tom       Meyer  computer scientist       Java
Bill      Mayer      data scientist     Pithon
Pete       Meyr  computer scientist     Pythen
Kate       Mair        psychiatrist  Brainfuck

In [18]:
df = pd.DataFrame(list(zip(first, last, job, language)), 
                  columns =['first', 'last', 'job', 'language']) 
df

      first   last                 job   language
0      Mike  Meyer        data analyst     Python
1  Dorothee  Maier          programmer       Perl
2       Tom  Meyer  computer scientist       Java
3      Bill  Mayer      data scientist     Pithon
4      Pete   Meyr          programmer     Pythen
5      Kate   Mair        psychiatrist  Brainfuck

In [19]:
df.replace(to_replace=['Mike', 'Tom', 'Perl'],
           value= ['Michael', 'Thomas', 'Python'], 
           inplace=True)
df

      first   last                 job   language
0   Michael  Meyer        data analyst     Python
1  Dorothee  Maier          programmer     Python
2    Thomas  Meyer  computer scientist       Java
3      Bill  Mayer      data scientist     Pithon
4      Pete   Meyr          programmer     Pythen
5      Kate   Mair        psychiatrist  Brainfuck

In [20]:
df.replace(to_replace=[r'M[ea][iy]e?r', r'P[iy]th[eo]n'],
           value=['Mayer', 'Python'],
           regex=True, 
           inplace=True)
df

      first   last                 job   language
0   Michael  Mayer        data analyst     Python
1  Dorothee  Mayer          programmer     Python
2    Thomas  Mayer  computer scientist       Java
3      Bill  Mayer      data scientist     Python
4      Pete  Mayer          programmer     Python
5      Kate  Mayer        psychiatrist  Brainfuck

In [21]:
df = pd.DataFrame({'A': [0, 1, 2, 3, 4],
                   'B': ['foo', 'bar', 'bloo', 'blee', 'bloo'],
                   'C': ['green', 'red', 'blue', 'yellow', 'green']})

df.replace(to_replace={"A": {0: 42, 3: 33}, 'B': {'bloo': 'vloo'}},
           inplace=True)
df

    A     B       C
0  42   foo   green
1   1   bar     red
2   2  vloo    blue
3  33  blee  yellow
4   4  vloo   green

In [23]:
import pandas as pd

df = pd.DataFrame({
    'name':['Ben', 'Kate', 'Agnes', 'Ashleigh', 'Tom'],
    'job':['programmer', 'NN', 'NN', 'engineer', 'teacher'],
    'language':['Java', 'Python', 'LN', 'LN', 'C']})
df

       name         job language
0       Ben  programmer     Java
1      Kate          NN   Python
2     Agnes          NN       LN
3  Ashleigh    engineer       LN
4       Tom     teacher        C

In [25]:
# method is backfill
df.replace(to_replace='NN', 
           value=None, 
           method='ffill')

       name         job language
0       Ben  programmer     Java
1      Kate  programmer   Python
2     Agnes  programmer       LN
3  Ashleigh    engineer       LN
4       Tom     teacher        C

In [26]:
df.replace(to_replace=['NN', 'LN'],
           value=None,
           method='ffill')

       name         job language
0       Ben  programmer     Java
1      Kate  programmer   Python
2     Agnes  programmer   Python
3  Ashleigh    engineer   Python
4       Tom     teacher        C

In [27]:
df.replace(['NN', 'LN'], value=None, method='bfill')

       name         job language
0       Ben  programmer     Java
1      Kate    engineer   Python
2     Agnes    engineer        C
3  Ashleigh    engineer        C
4       Tom     teacher        C

In [28]:
df.replace('NN', 
           value=None,
           inplace=True,
           method='bfill')
df.replace('LN', 
           value=None,
           inplace=True,
           method='ffill')
df

       name         job language
0       Ben  programmer     Java
1      Kate    engineer   Python
2     Agnes    engineer   Python
3  Ashleigh    engineer   Python
4       Tom     teacher        C

In [29]:
df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
                  index=['cobra', 'viper', 'sidewinder'],
                  columns=['max_speed', 'shield'])

df

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

In [30]:
df.loc['viper']

max_speed    4
shield       5
Name: viper, dtype: int64

In [31]:
df.loc[['viper', 'sidewinder']]

            max_speed  shield
viper               4       5
sidewinder          7       8

In [32]:
df.loc['cobra', 'shield']

2

In [33]:
df.loc['cobra':'viper', 'max_speed']

cobra    1
viper    4
Name: max_speed, dtype: int64

In [34]:
df.loc[[False, False, True]]

            max_speed  shield
sidewinder          7       8

In [35]:
df.loc[df['shield'] > 6]

            max_speed  shield
sidewinder          7       8

In [37]:
df.loc[df['shield'] > 3, ['shield','max_speed']]

            shield  max_speed
viper            5          4
sidewinder       8          7

In [38]:
df.loc[lambda df: df['shield'] == 8]

            max_speed  shield
sidewinder          7       8

In [39]:
df.loc[['viper', 'sidewinder'], ['shield']] = 50
df

            max_speed  shield
cobra               1       2
viper               4      50
sidewinder          7      50

In [40]:
df.loc['cobra'] = 10
df

            max_speed  shield
cobra              10      10
viper               4      50
sidewinder          7      50

In [41]:
df.loc[:, 'max_speed'] = 30
df

            max_speed  shield
cobra              30      10
viper              30      50
sidewinder         30      50

In [42]:
df.loc[df['shield'] > 35] = 0
df

            max_speed  shield
cobra              30      10
viper               0       0
sidewinder          0       0